In [16]:
import pandas as pd
students = ['AA','BB','CC']
pd.Series(students)

0    AA
1    BB
2    CC
dtype: object

In [ ]:
numbers = [1,2,3]
pd.Series(numbers)

In [ ]:
students = ['AA','BB',None]
pd.Series(students)

In [ ]:
numbers = [1,2,None]
pd.Series(numbers)

In [ ]:
import numpy as np
[np.nan == None, np.nan == np.nan, np.isnan(np.nan)]

In [17]:
students_scores = {'AA':'Phy','BB':'Chem','CC':'Eng'}
s = pd.Series(students_scores)
s

AA     Phy
BB    Chem
CC     Eng
dtype: object

In [ ]:
s.index

In [ ]:
s = pd.Series(['Phy', 'Chem', 'Eng'], index=['AA', 'BB', 'CC'])
s

In [19]:
students_scores = {'AA':'Phy','BB':'Chem','CC':'Eng'}
s = pd.Series(students_scores, index=['AA','BB','DD'])
s

AA     Phy
BB    Chem
DD     NaN
dtype: object

In [18]:
students_classes = {'AA':'Phy','BB':'Chem','CC':'Eng', 'DD':'Hist'}
s = pd.Series(students_classes)
s.iloc[3]

'Hist'

In [ ]:
s.loc['BB']

In [ ]:
s[3] # position

In [ ]:
s['BB'] # label

In [ ]:
class_code = {99:'Phy', 100:'Chem',101:'Eng',103:'Hist'}
s = pd.Series(class_code)
s.iloc[0] # s[0] -> error

In [ ]:
grades = pd.Series([90,80,70,60])
total = np.sum(grades)
print(total/len(grades))

In [ ]:
numbers = pd.Series(np.random.randint(0,1000,10000))
numbers.head()

In [ ]:
%%timeit -n 100
total = 0
for number in numbers:
    total += number
total/len(numbers)

In [ ]:
%%timeit -n 100
total = np.sum(numbers)
total/len(numbers)

In [ ]:
numbers += 2
numbers.head()

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,10000))
for label, value in numbers.iteritems():
    s.loc[label] = value+2

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,10000))
s += 2

In [ ]:
s = pd.Series([1,2,3])
s.loc['AA'] = 102
s

In [ ]:
aa_classes = {'AA':'Phy','AA':'Chem','AA':'Eng', 'AA':'Hist'}
aa_classes = pd.Series(aa_classes)
aa_classes

In [ ]:
aa_classes = pd.Series(['Phy', 'Chem', 'Eng', 'Hist'], index=['AA', 'AA', 'AA', 'AA'])
aa_classes

In [ ]:
students_classes = pd.Series(['Phy', 'Chem', 'Eng', 'Hist'], index=['AA', 'BB', 'CC', 'DD'])
all_stu_class = students_classes.append(aa_classes)
all_stu_class

In [ ]:
students_classes

In [ ]:
all_stu_class.loc['AA']

In [ ]:
import pandas as pd

record1 = pd.Series({'Name':'AA', 'Class':'Phy', 'Score':85})
record2 = pd.Series({'Name':'BB', 'Class':'Chem', 'Score':82})
record3 = pd.Series({'Name':'CC', 'Class':'Bio', 'Score':98})

df = pd.DataFrame([record1,record2,record3], index=['school1','school2','school3'])
df.head()

In [ ]:
import pandas as pd
students = [{'Name':'AA', 'Class':'Phy', 'Score':85},
            {'Name':'BB', 'Class':'Chem', 'Score':82},
            {'Name':'CC', 'Class':'Bio', 'Score':98}]
df = pd.DataFrame(students, index=['school1','school2','school1'])
df

In [ ]:
df.loc['school2']

In [ ]:
type(df.loc['school2'])

In [ ]:
type(df.loc['school1'])

In [ ]:
df.loc['school1', 'Name']

In [ ]:
df.T

In [ ]:
df.T.loc['Name']

In [ ]:
df['Name']

In [ ]:
type(df['Name'])

In [ ]:
df.loc['school1']['Name']

In [ ]:
print(type(df.loc['school1']))
print(type(df.loc['school1']['Name']))

In [ ]:
df.loc[:,['Name','Score']]

In [ ]:
# drop: give new df
df.drop('school1')

In [ ]:
df

In [ ]:
copy_df = df.copy()
copy_df.drop('Name', inplace=True, axis=1)
copy_df

In [ ]:
del copy_df['Class']
copy_df

In [ ]:
df['ClassRanking'] = None
df

In [ ]:
import pandas as pd

df = pd.read_csv('assets\census.csv') # windows OS
df.head()

In [ ]:
df = pd.read_csv('assets\census.csv', index_col = ['STNAME', 'CTYNAME']) # windows OS
df.head()

In [ ]:
new_df = df.rename(columns={'STATE':'Satus', 'COUNTY':'County'})
new_df.head()

In [ ]:
new_df.columns

In [ ]:
# mapper
new_df = df.rename(mapper = str.strip, acis='columns') # take off space

In [2]:
import pandas as pd

# replace columns title
locations = [
    {'Name':'Alice', 'Age':1, 'Gender':'F'},
    {'Name':'Jack', 'Age':5, 'Gender':'M'},
    {'Name':'Alice', 'Age':5, 'Gender':'M'}
]
df = pd.DataFrame(locations, index = ['Mathmatics', 'Sociology', 'Math'])

cols = list(df.columns)
cols = [x.lower().strip() for x in cols]
df.columns= cols
df.head()

             name  age gender
Mathmatics  Alice    1      F
Sociology    Jack    5      M
Math        Alice    5      M

In [3]:
age_mask = df['age'] > 2 # Return a bool Series
age_mask

Mathmatics    False
Sociology      True
Math           True
Name: age, dtype: bool

In [4]:
# where()  + mask
df.where(age_mask)

             name  age gender
Mathmatics    NaN  NaN    NaN
Sociology    Jack  5.0      M
Math        Alice  5.0      M

In [5]:
# dropna()
df.where(age_mask).dropna()

            name  age gender
Sociology   Jack  5.0      M
Math       Alice  5.0      M

In [6]:
df[df['age'] > 2]

            name  age gender
Sociology   Jack    5      M
Math       Alice    5      M

In [7]:
df[['name','age']]

             name  age
Mathmatics  Alice    1
Sociology    Jack    5
Math        Alice    5

In [13]:
import pandas as pd

df = pd.read_csv('dataset/Admission_Predict.csv') # UNIX
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,324,107,4,4.0,4.5,8.87,1,0.76
2,3,316,104,3,3.0,3.5,8.00,1,0.72
3,4,322,110,3,3.5,2.5,8.67,1,0.80
4,5,314,103,2,2.0,3.0,8.21,0,0.65

In [15]:
df['Serial Number'] = df.index
df = df.set_index('Chance of Admit ')
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Serial Number
Chance of Admit,,,,,,,,,
0.92,1,337,118,4,4.5,4.5,9.65,1,0
0.76,2,324,107,4,4.0,4.5,8.87,1,1
0.72,3,316,104,3,3.0,3.5,8.00,1,2
0.80,4,322,110,3,3.5,2.5,8.67,1,3
0.65,5,314,103,2,2.0,3.0,8.21,0,4

In [ ]:
import pandas as pd

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [ ]:
x = obj2['California']
obj2['California'] != x

In [ ]:
obj2['California'] == None

In [ ]:
import math
math.isnan(obj2['California'])

In [ ]:
obj3['California']

In [ ]:
obj3

In [ ]:
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)
S.iloc[0:3]

In [ ]:
students = [{'Name':'AA', 'Class':'Phy', 'Score':85},
            {'Name':'BB', 'Class':'Chem', 'Score':82},
            {'Name':'CC', 'Class':'Bio', 'Score':98}]
df = pd.DataFrame(students, index=['school1','school2','school1'])

# df.rename(mapper = lambda x:x.upper(), axis=1)
# df

# df = df.rename(mapper = lambda x:x.upper(), axis=1)
# df

# df = df.rename(mapper = lambda x:x.upper(), axis='columns')
# df

df.rename(mapper = lambda x:x.upper(), axis=1, inplace='True')
df

In [ ]:
df = df.rename(mapper = lambda x:x.upper(), axis=1)
df

In [ ]:
toefl_score = [
    {'Serial No':1, 'gre score':337, 'toefl score':118},
    {'Serial No':2, 'gre score':327, 'toefl score':108},
    {'Serial No':3, 'gre score':317, 'toefl score':100},
    {'Serial No':4, 'gre score':307},
    {'Serial No':4, 'toefl score':107}
]
df = pd.DataFrame(toefl_score)
df[df['toefl score'] > 105].dropna()

In [ ]:
locations = [
    {'one':0, 'two':1, 'three':2},
    {'one':4, 'two':5, 'three':6},
    {'one':8, 'two':9, 'three':10}
]
df = pd.DataFrame(locations, index = ['Ohio', 'Colorado', 'Utah'])
# df.drop(['Ohio', 'Utah'])
# df.drop('Ohio')
df.drop('two', axis =1)  # df.drop('two') should claim "axis"

In [ ]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
# s1.loc[1]
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})
# s2.loc[1] # Error!!
# s2[1] # 2
# s2.iloc[1] # 2

In [ ]:
aa_classes = pd.Series(['Phy', 'Chem', 'Eng', 'Hist'], index=['AA', 'AA', 'AA', 'AA'])
aa_classes['AA']

In [8]:
toefl_score = [
    {'Serial No':1, 'gre score':337, 'toefl score':115},
    {'Serial No':2, 'gre score':327, 'toefl score':108},
    {'Serial No':3, 'gre score':317, 'toefl score':100},
    {'Serial No':4, 'gre score':307},
    {'Serial No':4, 'toefl score':105}
]
df = pd.DataFrame(toefl_score)
df[(df['toefl score'].isin(range(106,115)))]

   Serial No  gre score  toefl score
1          2      327.0        108.0

In [ ]:
(df['toefl score'] > 105 ) & (df['toefl score'] < 115 ) # Will give boll Series
df[(df['toefl score'] > 105 ) & (df['toefl score'] < 115 )]

In [11]:
df[(df['toefl score'].gt(105) ) & (df['toefl score'].lt(115) )]

   Serial No  gre score  toefl score
1          2      327.0        108.0

In [ ]:
locations = [
    {'Name':'Alice', 'Age':1, 'Gender':'F'},
    {'Name':'Jack', 'Age':5, 'Gender':'M'},
    {'Name':'Alice', 'Age':5, 'Gender':'M'}
]
df = pd.DataFrame(locations, index = ['Mathmatics', 'Sociology', 'Math'])
df.T['Mathmatics']